[Killed] ArrayDeclaration
src/ScholarshipEligibilityEvaluator.js:24:27
     validateInputs(gpa, attendanceRate);
 
     const rejectionReasons = [];
-    const reviewReasons = [];
+    const reviewReasons = ["Stryker was here"];
 
     // Rule 1 - Age
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:27:9
     const reviewReasons = [];
 
     // Rule 1 - Age
-    if (age < 16) {
+    if (false) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
     } else if (age <= 17) {
killedBy: REJECTED idade abaixo do mínimo é rejeitada
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "MANUAL_REVIEW"

[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:29:27
     // Rule 1 - Age
     if (age < 16) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
-    } else if (age <= 17) {
-        reviewReasons.push("Applicant is under 18 and requires manual review.");
-    }
+    } else if (age <= 17) {}
 
     // Rule 2 - GPA
killedBy: MANUAL_REVIEW idade entre 16 e 17 gera revisão manual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:29:16
     // Rule 1 - Age
     if (age < 16) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
-    } else if (age <= 17) {
+    } else if (true) {
         reviewReasons.push("Applicant is under 18 and requires manual review.");
     }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:34:9
     }
 
     // Rule 2 - GPA
-    if (gpa < 6.0) {
+    if (gpa >= 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
     } else if (gpa < 7.0) {
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:36:16
     // Rule 2 - GPA
     if (gpa < 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
-    } else if (gpa < 7.0) {
+    } else if (false) {
         reviewReasons.push("GPA is in the manual review range.");
     }
killedBy: MANUAL_REVIEW múltiplos motivos de revisão são acumulados (idade + GPA)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "Applicant is under 18 and requires manual review.",
-   "GPA is in the manual review range.",

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:37:28
     if (gpa < 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
     } else if (gpa < 7.0) {
-        reviewReasons.push("GPA is in the manual review range.");
+        reviewReasons.push("");
     }
 
killedBy: MANUAL_REVIEW múltiplos motivos de revisão são acumulados (idade + GPA)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "Applicant is under 18 and requires manual review.",
-   "GPA is in the manual review range.",

[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:41:32
     }
 
     // Rule 3 - Attendance
-    if (attendanceRate < 75.0) {
-        rejectionReasons.push("Attendance rate is below the minimum required.");
-    } else if (attendanceRate < 80.0) {
+    if (attendanceRate < 75.0) {} else if (attendanceRate < 80.0) {
         reviewReasons.push("Attendance rate is in the manual review range.");
     }
killedBy: REJECTED frequência abaixo do mínimo é rejeitada
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:42:31
 
     // Rule 3 - Attendance
     if (attendanceRate < 75.0) {
-        rejectionReasons.push("Attendance rate is below the minimum required.");
+        rejectionReasons.push("");
     } else if (attendanceRate < 80.0) {
         reviewReasons.push("Attendance rate is in the manual review range.");
killedBy: REJECTED frequência abaixo do mínimo é rejeitada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Attendance rate is below the minimum required.",
+   "",

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:43:16
     // Rule 3 - Attendance
     if (attendanceRate < 75.0) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
-    } else if (attendanceRate < 80.0) {
+    } else if (attendanceRate >= 80.0) {
         reviewReasons.push("Attendance rate is in the manual review range.");
     }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:49:31
 
     // Rule 4 - Required courses
     if (!hasRequiredCourses) {
-        rejectionReasons.push("Required courses have not been completed.");
+        rejectionReasons.push("");
     }
 
killedBy: REJECTED cursos obrigatórios não concluídos são rejeitados
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Required courses have not been completed.",
+   "",

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:54:31
 
     // Rule 5 - Disciplinary record
     if (disciplinaryRecord) {
-        rejectionReasons.push("Applicant has a disciplinary record.");
+        rejectionReasons.push("");
     }
 
killedBy: REJECTED registro disciplinar é rejeitado
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Applicant has a disciplinary record.",
+   "",

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:58:9
     }
 
     // Final decision
-    if (rejectionReasons.length > 0) {
+    if (rejectionReasons.length >= 0) {
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:62:35
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
 
-    if (reviewReasons.length > 0) {
-        return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
-    }
+    if (reviewReasons.length > 0) {}
 
     return new EvaluationResult(
killedBy: MANUAL_REVIEW idade entre 16 e 17 gera revisão manual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:62:9
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
 
-    if (reviewReasons.length > 0) {
+    if (false) {
         return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
     }
killedBy: MANUAL_REVIEW idade entre 16 e 17 gera revisão manual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:68:10
 
     return new EvaluationResult(
         Status.APPROVED,
-        ["Applicant meets all scholarship requirements."]
+        [""]
     );
 }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Applicant meets all scholarship requirements.",
+   "",

[Killed] LogicalOperator
src/ScholarshipEligibilityEvaluator.js:73:9
 }
 
 function validateInputs(gpa, attendanceRate) {
-    if (gpa < 0.0 || gpa > 10.0) {
+    if (gpa < 0.0 && gpa > 10.0) {
         throw new Error("GPA must be between 0 and 10.");
     }
killedBy: Entradas inválidas GPA negativo lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GPA must be between 0 and 10."

Received function did not throw

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:74:25
 
 function validateInputs(gpa, attendanceRate) {
     if (gpa < 0.0 || gpa > 10.0) {
-        throw new Error("GPA must be between 0 and 10.");
+        throw new Error("");
     }
 
killedBy: Entradas inválidas GPA negativo lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GPA must be between 0 and 10."
Received message:   ""

      172 |       } else {
      173 |         stryCov_9fa48("74");
    > 174 |         throw new Error(stryMutAct_9fa48("75") ? "" : (stryCov_9fa48("75"), "GPA must be between 0 and 10."));

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:77:33
         throw new Error("GPA must be between 0 and 10.");
     }
 
-    if (attendanceRate < 0.0 || attendanceRate > 100.0) {
+    if (attendanceRate < 0.0 || attendanceRate <= 100.0) {
         throw new Error("Attendance rate must be between 0 and 100.");
     }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: Attendance rate must be between 0 and 100.

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:77:33
         throw new Error("GPA must be between 0 and 10.");
     }
 
-    if (attendanceRate < 0.0 || attendanceRate > 100.0) {
+    if (attendanceRate < 0.0 || false) {
         throw new Error("Attendance rate must be between 0 and 100.");
     }
killedBy: Entradas inválidas frequência acima de 100 lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Attendance rate must be between 0 and 100."

Received function did not throw

[Survived] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:84:5
 
 
 // Example usage
-if (require.main === module) {
+if (require.main !== module) {
     const result = evaluateScholarship(
         18,

[Survived] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:84:5
 
 
 // Example usage
-if (require.main === module) {
+if (false) {
     const result = evaluateScholarship(
         18,
