[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:10:32
 });
 
 class EvaluationResult {
-  constructor(status, reasons) {
-    this.status = status;
-    this.reasons = Object.freeze([...reasons]);
-    Object.freeze(this);
-  }
+  constructor(status, reasons) {}
 
   toString() {
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: undefined

[NoCoverage] BlockStatement
src/ScholarshipEligibilityEvaluator.js:16:14
     Object.freeze(this);
   }
 
-  toString() {
-    return `EvaluationResult{status=${this.status}, reasons=${JSON.stringify(this.reasons)}}`;
-  }
+  toString() {}
 }
 

[NoCoverage] StringLiteral
src/ScholarshipEligibilityEvaluator.js:17:12
   }
 
   toString() {
-    return `EvaluationResult{status=${this.status}, reasons=${JSON.stringify(this.reasons)}}`;
+    return ``;
   }
 }

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:28:7
   const reviewReasons = [];
 
   // Rule 1 - Age
-  if (age < 16) {
+  if (true) {
     rejectionReasons.push('Applicant is younger than the minimum age.');
   } else if (age <= 17) {
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:30:14
   // Rule 1 - Age
   if (age < 16) {
     rejectionReasons.push('Applicant is younger than the minimum age.');
-  } else if (age <= 17) {
+  } else if (age < 17) {
     reviewReasons.push('Applicant is under 18 and requires manual review.');
   }
killedBy: MANUAL_REVIEW idade entre 16 e 17 gera revisão manual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:30:14
   // Rule 1 - Age
   if (age < 16) {
     rejectionReasons.push('Applicant is younger than the minimum age.');
-  } else if (age <= 17) {
+  } else if (age > 17) {
     reviewReasons.push('Applicant is under 18 and requires manual review.');
   }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:31:24
   if (age < 16) {
     rejectionReasons.push('Applicant is younger than the minimum age.');
   } else if (age <= 17) {
-    reviewReasons.push('Applicant is under 18 and requires manual review.');
+    reviewReasons.push("");
   }
 
killedBy: MANUAL_REVIEW idade entre 16 e 17 gera revisão manual
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Applicant is under 18 and requires manual review.",
+   "",

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:35:7
   }
 
   // Rule 2 - GPA
-  if (gpa < 6.0) {
+  if (false) {
     rejectionReasons.push('GPA is below the minimum required.');
   } else if (gpa < 7.0) {
killedBy: REJECTED GPA abaixo do mínimo é rejeitado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:37:14
   // Rule 2 - GPA
   if (gpa < 6.0) {
     rejectionReasons.push('GPA is below the minimum required.');
-  } else if (gpa < 7.0) {
+  } else if (true) {
     reviewReasons.push('GPA is in the manual review range.');
   }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:37:14
   // Rule 2 - GPA
   if (gpa < 6.0) {
     rejectionReasons.push('GPA is below the minimum required.');
-  } else if (gpa < 7.0) {
+  } else if (gpa <= 7.0) {
     reviewReasons.push('GPA is in the manual review range.');
   }
killedBy: Valores de fronteira GPA (limiares: 6.0, 7.0, 0, 10) gpa=7.0 -> não gera motivo de GPA (aprovável)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:38:24
   if (gpa < 6.0) {
     rejectionReasons.push('GPA is below the minimum required.');
   } else if (gpa < 7.0) {
-    reviewReasons.push('GPA is in the manual review range.');
+    reviewReasons.push("");
   }
 
killedBy: MANUAL_REVIEW múltiplos motivos de revisão são acumulados (idade + GPA)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "Applicant is under 18 and requires manual review.",
-   "GPA is in the manual review range.",

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:42:7
   }
 
   // Rule 3 - Attendance
-  if (attendanceRate < 75.0) {
+  if (attendanceRate >= 75.0) {
     rejectionReasons.push('Attendance rate is below the minimum required.');
   } else if (attendanceRate < 80.0) {
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:43:27
 
   // Rule 3 - Attendance
   if (attendanceRate < 75.0) {
-    rejectionReasons.push('Attendance rate is below the minimum required.');
+    rejectionReasons.push("");
   } else if (attendanceRate < 80.0) {
     reviewReasons.push('Attendance rate is in the manual review range.');
killedBy: REJECTED frequência abaixo do mínimo é rejeitada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Attendance rate is below the minimum required.",
+   "",

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:44:14
   // Rule 3 - Attendance
   if (attendanceRate < 75.0) {
     rejectionReasons.push('Attendance rate is below the minimum required.');
-  } else if (attendanceRate < 80.0) {
+  } else if (attendanceRate >= 80.0) {
     reviewReasons.push('Attendance rate is in the manual review range.');
   }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:44:14
   // Rule 3 - Attendance
   if (attendanceRate < 75.0) {
     rejectionReasons.push('Attendance rate is below the minimum required.');
-  } else if (attendanceRate < 80.0) {
+  } else if (false) {
     reviewReasons.push('Attendance rate is in the manual review range.');
   }
killedBy: Valores de fronteira Frequência (limiares: 75, 80, 0, 100) attendanceRate=75 -> revisão (limite inferior inclusivo)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Survived] StringLiteral
src/ScholarshipEligibilityEvaluator.js:45:24
   if (attendanceRate < 75.0) {
     rejectionReasons.push('Attendance rate is below the minimum required.');
   } else if (attendanceRate < 80.0) {
-    reviewReasons.push('Attendance rate is in the manual review range.');
+    reviewReasons.push("");
   }
 

[Killed] ConditionalExpression
src/ScholarshipEligibilityEvaluator.js:49:7
   }
 
   // Rule 4 - Required courses
-  if (!hasRequiredCourses) {
+  if (false) {
     rejectionReasons.push('Required courses have not been completed.');
   }
killedBy: REJECTED cursos obrigatórios não concluídos são rejeitados
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:63:7
     return new EvaluationResult(Status.REJECTED, rejectionReasons);
   }
 
-  if (reviewReasons.length > 0) {
+  if (reviewReasons.length <= 0) {
     return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
   }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ArrayDeclaration
src/ScholarshipEligibilityEvaluator.js:67:48
     return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
   }
 
-  return new EvaluationResult(Status.APPROVED, ['Applicant meets all scholarship requirements.']);
+  return new EvaluationResult(Status.APPROVED, []);
 }
 
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Applicant meets all scholarship requirements.",
- ]

[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:70:46
   return new EvaluationResult(Status.APPROVED, ['Applicant meets all scholarship requirements.']);
 }
 
-function validateInputs(gpa, attendanceRate) {
-  if (gpa < 0.0 || gpa > 10.0) {
-    throw new RangeError('GPA must be between 0 and 10.');
-  }
-
-  if (attendanceRate < 0.0 || attendanceRate > 100.0) {
-    throw new RangeError('Attendance rate must be between 0 and 100.');
-  }
-}
+function validateInputs(gpa, attendanceRate) {}
 
 // Manual use example
killedBy: Entradas inválidas GPA negativo lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: RangeError

Received function did not throw

[Killed] BlockStatement
src/ScholarshipEligibilityEvaluator.js:71:32
 }
 
 function validateInputs(gpa, attendanceRate) {
-  if (gpa < 0.0 || gpa > 10.0) {
-    throw new RangeError('GPA must be between 0 and 10.');
-  }
+  if (gpa < 0.0 || gpa > 10.0) {}
 
   if (attendanceRate < 0.0 || attendanceRate > 100.0) {
killedBy: Entradas inválidas GPA negativo lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: RangeError

Received function did not throw

[Killed] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:71:20
 }
 
 function validateInputs(gpa, attendanceRate) {
-  if (gpa < 0.0 || gpa > 10.0) {
+  if (gpa < 0.0 || gpa <= 10.0) {
     throw new RangeError('GPA must be between 0 and 10.');
   }
killedBy: APPROVED candidato que atende a todos os critérios é aprovado
statusReason: RangeError: GPA must be between 0 and 10.

[Killed] StringLiteral
src/ScholarshipEligibilityEvaluator.js:76:26
   }
 
   if (attendanceRate < 0.0 || attendanceRate > 100.0) {
-    throw new RangeError('Attendance rate must be between 0 and 100.');
+    throw new RangeError("");
   }
 }
killedBy: Entradas inválidas frequência negativa lança erro de validação
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Attendance rate must be between 0 and 100."
Received message:   ""

      191 |       } else {
      192 |         stryCov_9fa48("89");
    > 193 |         throw new RangeError(stryMutAct_9fa48("90") ? "" : (stryCov_9fa48("90"), 'Attendance rate must be between 0 and 100.'));

[NoCoverage] BlockStatement
src/ScholarshipEligibilityEvaluator.js:81:30
 }
 
 // Manual use example
-if (require.main === module) {
-  const result = evaluateScholarship(18, 8.5, 92.0, true, false);
-  console.log(result.toString());
-}
+if (require.main === module) {}
 
 module.exports = { evaluateScholarship, Status, EvaluationResult };

[Survived] EqualityOperator
src/ScholarshipEligibilityEvaluator.js:81:5
 }
 
 // Manual use example
-if (require.main === module) {
+if (require.main !== module) {
   const result = evaluateScholarship(18, 8.5, 92.0, true, false);
   console.log(result.toString());

[NoCoverage] BooleanLiteral
src/ScholarshipEligibilityEvaluator.js:82:59
 
 // Manual use example
 if (require.main === module) {
-  const result = evaluateScholarship(18, 8.5, 92.0, true, false);
+  const result = evaluateScholarship(18, 8.5, 92.0, true, true);
   console.log(result.toString());
 }

[NoCoverage] BooleanLiteral
src/ScholarshipEligibilityEvaluator.js:82:53
 
 // Manual use example
 if (require.main === module) {
-  const result = evaluateScholarship(18, 8.5, 92.0, true, false);
+  const result = evaluateScholarship(18, 8.5, 92.0, false, false);
   console.log(result.toString());
 }
